{
    "format": "graph-model",
    "generatedBy": "2.14.0",
    "convertedBy": "TensorFlow.js Converter v3.21.0",
    "signature": {
        "inputs": {
            "flatten_input": {
                "name": "flatten_input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "28"
                        },
                        {
                            "size": "28"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "dense_2": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "10"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/sequential/flatten/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "784"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "10"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "10"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "flatten_input",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "28"
                                },
                                {
                                    "size": "28"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/flatten/Reshape",
                "op": "Reshape",
                "input": [
                    "flatten_input",
                    "StatefulPartitionedCall/sequential/flatten/Const"
                ],
                "attr": {
                    "Tshape": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/flatten/Reshape",
                    "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "transpose_a": {
                        "b": false
                    },
                    "epsilon": {
                        "f": 0.0
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense/Relu",
                    "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "transpose_b": {
                        "b": false
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_1/Relu",
                    "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "num_args": {
                        "i": "1"
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "transpose_a": {
                        "b": false
                    },
                    "epsilon": {
                        "f": 0.0
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/Softmax",
                "op": "Softmax",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_2/BiasAdd"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_2/Softmax"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 1286
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "StatefulPartitionedCall/sequential/flatten/Const",
                    "shape": [
                        2
                    ],
                    "dtype": "int32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "shape": [
                        784,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                    "shape": [
                        256,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}